<a href="https://colab.research.google.com/github/np03cs4a240070-oss/worksheet1-umikapoudel/blob/main/week2workshop.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#• Dataset for the Task: "bank.csv"
#1. Load the provided dataset and import in pandas DataFrame.
import pandas as pd
dataset=pd.read_csv("/content/drive/MyDrive/Dataset/bank.csv")
dataset.head()#first 5 rows of the dataset
dataset.info()#info of the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

In [13]:
#2. Check info of the DataFrame and identify following:
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Dataset/bank.csv")
# (a) Columns with dtype=object
object_columns = df.select_dtypes(include='object').columns
print("Columns with dtype=object:")
print(object_columns)
# (b) Unique values of those columns.
for col in object_columns:
    print(f"\nUnique values in '{col}':")
    print(df[col].unique())
#(c) check for the total number of null values in each column.
print("\nNull values in each column:")
print(df.isnull().sum())
#3. Drop all the columns with dtypes object and store in new DataFrame, also write the DataFrame in ".csv" with name ”banknumericdata.csv”
df_numeric = df.drop(columns=object_columns)
df_numeric.to_csv("banknumericdata.csv", index=False)
print("New numeric DataFrame saved as banknumericdata.csv")
#4. Read ”banknumericdata.csv” and Find the summary statistics.
df_new = pd.read_csv("banknumericdata.csv")
print("\nSummary statistics of numeric DataFrame:")
print(df_new.describe())

Columns with dtype=object:
Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'month', 'poutcome', 'y'],
      dtype='object')

Unique values in 'job':
['management' 'technician' 'entrepreneur' 'blue-collar' 'unknown'
 'retired' 'admin.' 'services' 'self-employed' 'unemployed' 'housemaid'
 'student']

Unique values in 'marital':
['married' 'single' 'divorced']

Unique values in 'education':
['tertiary' 'secondary' 'unknown' 'primary']

Unique values in 'default':
['no' 'yes']

Unique values in 'housing':
['yes' 'no']

Unique values in 'loan':
['no' 'yes']

Unique values in 'contact':
['unknown' 'cellular' 'telephone']

Unique values in 'month':
['may' 'jun' 'jul' 'aug' 'oct' 'nov' 'dec' 'jan' 'feb' 'mar' 'apr' 'sep']

Unique values in 'poutcome':
['unknown' 'failure' 'other' 'success']

Unique values in 'y':
['no' 'yes']

Null values in each column:
age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64
New numeric DataFrame saved as banknumericdata.csv

Summary statistics of numeric DataFrame:
                age        balance           day      duration      campaign  \
count  45211.000000   45211.000000  45211.000000  45211.000000  45211.000000
mean      40.936210    1362.272058     15.806419    258.163080      2.763841
std       10.618762    3044.765829      8.322476    257.527812      3.098021
min       18.000000   -8019.000000      1.000000      0.000000      1.000000
25%       33.000000      72.000000      8.000000    103.000000      1.000000
50%       39.000000     448.000000     16.000000    180.000000      2.000000
75%       48.000000    1428.000000     21.000000    319.000000      3.000000
max       95.000000  102127.000000     31.000000   4918.000000     63.000000

              pdays      previous
count  45211.000000  45211.000000
mean      40.197828      0.580323
std      100.128746      2.303441
min       -1.000000      0.000000
25%       -1.000000      0.000000
50%       -1.000000      0.000000
75%       -1.000000      0.000000
max      871.000000    275.000000

In [ ]:
# • Dataset for the Task: "medical_student.csv"
# 1. Load the provided dataset and import in pandas DataFrame.
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Dataset/medical_students_dataset.csv")
df.head()
# 2. Check info of the DataFrame and identify column with missing (null) values.
df.info()
print("\nMissing values in each column:")
print(df.isnull().sum())
# 3. For the column with missing values fill the values using various techniques we discussed above. Try to explain why did you select the particular methods for particular column.

# 4. Check for any duplicate values present in Dataset and do necessary to manage the duplicate items.{Hint: dataset.duplicated.sum()}
df.duplicated().sum()
df = df.drop_duplicates()
df.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 13 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Student ID      180000 non-null  float64
 1   Age             180000 non-null  float64
 2   Gender          180000 non-null  object
 3   Height          180000 non-null  float64
 4   Weight          180000 non-null  float64
 5   Blood Type      180000 non-null  object
 6   BMI             180000 non-null  float64
 7   Temperature     180000 non-null  float64
 8   Heart Rate      180000 non-null  float64
 9   Blood Pressure  180000 non-null  float64
 10  Cholesterol     180000 non-null  float64
 11  Diabetes        180000 non-null  object
 12  Smoking         180000 non-null  object
dtypes: float64(9), object(4)
memory usage: 19.8+ MB

Missing values in each column:
Student ID        20000
Age               20000
Gender            20000
Height            20000
Weight            20000
Blood Type        20000
BMI               20000
Temperature       20000
Heart Rate        20000
Blood Pressure    20000
Cholesterol       20000
Diabetes          20000
Smoking           20000
dtype: int64

np.int64(0)

In [ ]:
# Create a DataFrame that is subsetted for the columns ’Name’, ’Pclass’, ’Sex’, ’Age’, ’Fare’, and ’Survived’. Retain only those rows where ’Pclass’ is equal to 1, representing first-class passengers. What is the mean, median, maximum value, and minimum value of the ’Fare’ column?
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Dataset/Titanic-Dataset.csv")
subset_df = df[['Name', 'Pclass', 'Sex', 'Age', 'Fare', 'Survived']]
first_class = subset_df[subset_df['Pclass'] == 1]
fare_mean = first_class['Fare'].mean()
fare_median = first_class['Fare'].median()
fare_max = first_class['Fare'].max()
fare_min = first_class['Fare'].min()

fare_mean, fare_median, fare_max, fare_min
print("Fare Statistics for First-Class Passengers:")
print("Mean Fare:   ", fare_mean)
print("Median Fare: ", fare_median)
print("Maximum Fare:", fare_max)
print("Minimum Fare:", fare_min)

Fare Statistics for First-Class Passengers:
Mean Fare:    84.1546875
Median Fare:  60.287499999999994
Maximum Fare: 512.3292
Minimum Fare: 0.0

In [10]:
# How many null values are contained in the ’Age’ column in your subsetted DataFrame? Once you’ve found this out, drop them from your DataFrame.
subset_df = df[['Name', 'Pclass', 'Sex', 'Age', 'Fare', 'Survived']]
null_age_count = subset_df['Age'].isnull().sum()
print("Number of null values in Age column:", null_age_count)
subset_df = subset_df.dropna(subset=['Age'])
print("Null values after dropping:", subset_df['Age'].isnull().sum())

Number of null values in Age column: 177
Null values after dropping: 0

In [12]:
# Problem - 3:
# The ’Embarked’ column in the Titanic dataset contains categorical data representing the ports of embarka-tion:
# • ’C’ for Cherbourg
# • ’Q’ for Queenstown
# • ’S’ for Southampton
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Dataset/Titanic-Dataset.csv")
embarked_dummies = pd.get_dummies(df['Embarked'], prefix='Embarked')
df = pd.concat([df, embarked_dummies], axis=1)
df = df.drop(columns=['Embarked'])
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin  Embarked_C  Embarked_Q  Embarked_S
0      0         A/5 21171   7.2500   NaN       False       False        True
1      0          PC 17599  71.2833   C85        True       False       False
2      0  STON/O2. 3101282   7.9250   NaN       False       False        True
3      0            113803  53.1000  C123       False       False        True
4      0            373450   8.0500   NaN       False       False        True

In [11]:
# Task:
# 1. Use one-hot encoding to convert the ’Embarked’ column into separate binary columns ('Embarked C','Embarked Q', 'Embarked S').
import pandas as pd
df = pd.read_csv("/content/drive/MyDrive/Dataset/Titanic-Dataset.csv")
embarked_dummies = pd.get_dummies(df['Embarked'],
                                  prefix='Embarked',
                                  columns=['Embarked'])
# 2. Add these new columns to the original DataFrame.
df = pd.concat([df, embarked_dummies], axis=1)
# 3. Drop the original 'Embarked' column.
df = df.drop(columns=['Embarked'])
# 4. Print the first few rows of the modified DataFrame to verify the changes.
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin  Embarked_C  Embarked_Q  Embarked_S
0      0         A/5 21171   7.2500   NaN       False       False        True
1      0          PC 17599  71.2833   C85        True       False       False
2      0  STON/O2. 3101282   7.9250   NaN       False       False        True
3      0            113803  53.1000  C123       False       False        True
4      0            373450   8.0500   NaN       False       False        True